Reports/СправкаОДоходахДляБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>СправкаОДоходахДляБанка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонБухгалтерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонОтделаКадров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДом</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонМоб</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСлужебный</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияДолжности</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Категории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабельУчетаОрганизации</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТабеляУчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разряд</Name>
					<Comment>vvv нужен для переноса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабельУчетаОрганизацииЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТабеляУчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Comment>Вид учета времени для явки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТСЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТСЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТСЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияДолжностиЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Категории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкцииЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Классность</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КлассностиВодителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаКадровогоПеремещения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКадровыхПеремещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СправкаОДоходахДляБанка/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
    ДокументРезультат.Очистить();
	
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
	ДокументРезультат.Защита             = Ложь;
	ДокументРезультат.ТолькоПросмотр     = Истина;
    ДокументРезультат.АвтоМасштаб		 = Истина;
	
	РеглВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
    СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, ДатаВыдачи);
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаАктуальности",ДатаВыдачи);
	Запрос.УстановитьПараметр("ДатаАктуальностиС", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаАктуальностиПо", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ФизЛицо",Сотрудник.Физлицо);
	
	Запрос.Текст =
	//vvv
	//"ВЫБРАТЬ
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//
	|	РаботникиОрганизацийСрезПоследних.Период КАК ДатаПриемаНаработу,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТПриемНаработу
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&ДатаАктуальности,
	|			ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|				И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//vvv
	//|ВЫБРАТЬ
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|			И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
	|	КОНЕЦ КАК Должность,
	//
	|	РаботникиОрганизацийСрезПоследних.Период КАК ДатаВступленияВДолжность,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.ВидДоговора КАК ВидДоговора,
	//vvv комментируем, данные берем из Таблицы трудовой договор
	//|	РаботникиОрганизацийСрезПоследних.Сотрудник.ВидТД КАК ВидТД,
	//|	РаботникиОрганизацийСрезПоследних.Сотрудник.ДатаОкончания КАК ДатаОкончанияДоговора,
	|	ТрудовойДоговор.ВидТД КАК ВидТД,
	|	ТрудовойДоговор.ДатаОкончания КАК ДатаОкончанияДоговора,
	//
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	NULL КАК Дата,
	|	NULL КАК Номер
	|ПОМЕСТИТЬ ВТТекущееСостояние
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&ДатаАктуальности,
	|			ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
	//vvv
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТрудовойДоговор.Сотрудник КАК Сотрудник,
	|			ТрудовойДоговор.ВидТД КАК ВидТД,
	|			ТрудовойДоговор.НомерТД КАК НомерТД,
	|			ТрудовойДоговор.ДатаПриема КАК ДатаПриема,
	|			ТрудовойДоговор.ДатаУвольнения КАК ДатаОкончания,
	|			ТрудовойДоговор.ДатаТД КАК ДатаТД
	|		ИЗ
	|			Документ.ТрудовойДоговор КАК ТрудовойДоговор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ //получаем дату последнего контракта и соединяем с таблицей договоров, чтобы взять остальные реквизиты
	|				ТрудовойДоговор.Сотрудник КАК Сотрудник,
	|				МАКСИМУМ(ТрудовойДоговор.ДатаТД) КАК ДатаТД
	|			ИЗ
	|				Документ.ТрудовойДоговор КАК ТрудовойДоговор
	|			ГДЕ
	|				ТрудовойДоговор.Сотрудник=&Сотрудник
	|			СГРУППИРОВАТЬ ПО
	|				ТрудовойДоговор.Сотрудник) КАК ТД
	|			ПО (ТД.Сотрудник = ТрудовойДоговор.Сотрудник)
	|				И (ТД.ДатаТД = ТрудовойДоговор.ДатаТД)
	|		ГДЕ
	|			ТрудовойДоговор.Сотрудник=&Сотрудник) КАК ТрудовойДоговор
	|	ПО ТрудовойДоговор.Сотрудник=РаботникиОрганизацийСрезПоследних.Сотрудник 
	//
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"" "",
	|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала,
	|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидДоговора,
	|	NULL,
	|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,
	|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
	|	ДоговорНаВыполнениеРаботСФизЛицом.Дата,
	|	ДоговорНаВыполнениеРаботСФизЛицом.Номер
	|ИЗ
	|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|ГДЕ
	|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|	И ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник = &Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, ФИОФизЛицСрезПоследних.ФизЛицо.Наименование) КАК ФИО,
	|	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФИОФизЛица
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ЛичныйНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ПОМЕСТИТЬ ВТПаспорт
	|ИЗ
	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Адрес,
	|	КонтактнаяИнформация.Объект КАК ФизЛицо
	|ПОМЕСТИТЬ ВТКонтактнаяИнформация
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &ФизЛицо
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущееСостояние.Сотрудник,
	|	ТекущееСостояние.Должность,
	|	ТекущееСостояние.ДатаВступленияВДолжность КАК ДатаПеревода,
	|	ТекущееСостояние.ВидДоговора,
	|	ТекущееСостояние.ВидТД,
	|	ТекущееСостояние.ДатаОкончанияДоговора,
	|	ТекущееСостояние.Дата,
	|	ТекущееСостояние.Номер,	
	|	ЕСТЬNULL(ПриемНаработу.ДатаПриемаНаработу, ТекущееСостояние.ДатаВступленияВДолжность) КАК ДатаПриема,
	|	ФИОФизЛица.ФИО,
	|	КонтактнаяИнформация.Адрес КАК Адрес,
	|	ЕСТЬNULL(Паспорт.ДокументВид, "" "") КАК ДокументВид,
	|	ЕСТЬNULL(Паспорт.ДокументСерия, "" "") КАК ДокументСерия,
	|	ЕСТЬNULL(Паспорт.ДокументНомер, "" "") КАК ДокументНомер,
	|	ЕСТЬNULL(Паспорт.ДокументДатаВыдачи, "" "") КАК ДокументДатаВыдачи,
	|	ЕСТЬNULL(Паспорт.ДокументКемВыдан, "" "") КАК ДокументКемВыдан,
	|	ЕСТЬNULL(Паспорт.ЛичныйНомер, "" "") КАК ЛичныйНомер
	|ИЗ
	|	ВТТекущееСостояние КАК ТекущееСостояние
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПриемНаработу КАК ПриемНаработу
	|		ПО ТекущееСостояние.Сотрудник = ПриемНаработу.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИОФизЛица КАК ФИОФизЛица
	|		ПО ТекущееСостояние.Сотрудник.Физлицо = ФИОФизЛица.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПаспорт КАК Паспорт
	|		ПО ТекущееСостояние.Сотрудник.Физлицо = Паспорт.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ТекущееСостояние.Сотрудник.Физлицо = КонтактнаяИнформация.ФизЛицо";
			

    Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ДокументРезультат.Очистить();
	Макет = ПолучитьМакет("СправкаОДоходах2012");
	//vvv
	Макет = ПолучитьМакет("СправкаОДоходах2014");
	//
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	СтрокаПаспорт = "";
	Если Выборка.Следующий() Тогда
		ОбластьШапка.Параметры.ФИО          = Выборка.ФИО;
		ОбластьШапка.Параметры.ДатаВыдачи   = ДатаВыдачи;
		ОбластьШапка.Параметры.НомерСправки = НомерСправки;
		ОбластьШапка.Параметры.ТелБух       = ТелефонБухгалтерии;
		ОбластьШапка.Параметры.ТелКадр      = ТелефонОтделаКадров;
		//vvv
		ОбластьШапка.Параметры.ТелРабДом    = СокрЛП(ТелефонСлужебный)+"  "+СокрЛП(ТелефонДом);
		ОбластьШапка.Параметры.ТелМоб       = ТелефонМоб;
		ОбластьШапка.Параметры.Банк         = Банк;
		//
		ОбластьШапка.Параметры.ДатаПриема   = Формат(Выборка.ДатаПриема,"ДФ='dd MMMM yyyy ""г.""'");
		ОбластьШапка.Параметры.Должность    = ?(СокрЛП(Выборка.Должность) = "","","в должности " + Выборка.Должность);
		//ОбластьШапка.Параметры.ДатаПеревода = Формат(Выборка.ДатаПеревода,"ДФ='dd MMMM yyyy ""г.""'");
		
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДатаОкончанияДоговора) Тогда
			ОбластьШапка.Параметры.ВидДоговора = "по трудовому договору на неопределенный срок";
			ОбластьШапка.Параметры.ДатаДоговора = "";
		ИначеЕсли  Выборка.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда Тогда
			ОбластьШапка.Параметры.ВидДоговора = "по договору ГПХ номер " + СокрЛП(Выборка.Номер) + " от " + Формат(Выборка.Дата,"ДФ='dd MMMM yyyy ""г.""'") + "сроком до";
			ОбластьШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаОкончанияДоговора,"ДФ='dd MMMM yyyy ""г.""'");
     	Иначе
			Если Выборка.ВидТД = Перечисления.ВидыТрудовыхДоговоров.Контракт Тогда
				ОбластьШапка.Параметры.ВидДоговора = " по контракту сроком действия до";
				ОбластьШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаОкончанияДоговора,"ДФ='dd MMMM yyyy ""г.""'");
			Иначе
				ОбластьШапка.Параметры.ВидДоговора = "по срочному трудовому договору сроком действия до ";
				ОбластьШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаОкончанияДоговора,"ДФ='dd MMMM yyyy ""г.""'");
			КонецЕсли;
	  	КонецЕсли;
		ЮрАдрес   = СведенияОбОрганизации.ЮридическийАдрес;
		ФактАдрес = СведенияОбОрганизации.ФактическийАдрес;
		
		ОбластьШапка.Параметры.ПолноеНаименованиеОрганизации = СведенияОбОрганизации.ПолноеНаименование;
        ОбластьШапка.Параметры.ЮрАдрес =  " юр. адрес: " + СведенияОбОрганизации.ЮридическийАдрес;
		Если ЗначениеЗаполнено(ФактАдрес) И ЮрАдрес <> ФактАдрес Тогда
			ОбластьШапка.Параметры.ФактАдрес = " факт. адрес: "+ СведенияОбОрганизации.ФактическийАдрес;
		КонецЕсли;
		ОбластьШапка.Параметры.УНП = СведенияОбОрганизации.ИНН;
		
		ОбластьШапка.Параметры.Период = Формат(ДатаНачала,"ДФ='dd MMMM yyyy '") + " - " + Формат(ДатаОкончания,"ДФ='dd MMMM yyyy '");
		
		СтрокаПаспорт = "" + СокрЛП(Выборка.ДокументВид) + ?(СокрЛП(Выборка.ДокументСерия) = "", "", " серия " + СокрЛП(Выборка.ДокументСерия) + " ") + " номер " + СокрЛП(Выборка.ДокументНомер) + " выдан " + Формат(Выборка.ДокументДатаВыдачи,"ДФ='dd MMMM yyyy ""года""'") + " " + СокрЛП(Выборка.ДокументКемВыдан); 

		ОбластьПодвал.Параметры.Паспорт = СокрЛП(СтрокаПаспорт);
		ОбластьПодвал.Параметры.ЛичныйНомер      = ?(СокрЛП(Выборка.ЛичныйНомер) = "", Сотрудник.ФИзЛицо.СтраховойНомерПФР, Выборка.ЛичныйНомер);
		ОбластьПодвал.Параметры.АдресСотрудника  =  Выборка.Адрес;
		
	
	КонецЕсли;
	
	МатПомощьПособия = Новый Массив;
	МатПомощьПособия.Добавить(Справочники.ДоходыНДФЛ.Код1211);	
    МатПомощьПособия.Добавить(Справочники.ДоходыНДФЛ.Код12181);
	МатПомощьПособия.Добавить(Справочники.ДоходыНДФЛ.Код12124);
	МатПомощьПособия.Добавить(Справочники.ДоходыНДФЛ.Код12117);
	МатПомощьПособия.Добавить(Справочники.ДоходыНДФЛ.Код163119иныеорг);
	
	ИсполнительныеЛисты = Новый Массив;
	ИсполнительныеЛисты.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом);
	ИсполнительныеЛисты.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомСНДФЛ);
	ИсполнительныеЛисты.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела);
	ИсполнительныеЛисты.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПределаСНДФЛ);
	ИсполнительныеЛисты.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела);
	
    Запрос.УстановитьПараметр("ДатаАктуальностиС", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаАктуальностиПо", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("МатПомощьПособия",МатПомощьПособия);
	Запрос.УстановитьПараметр("ИсполнительныеЛисты",ИсполнительныеЛисты);
	Запрос.УстановитьПараметр("ИспЛистФиксСуммой",ПланыВидовРасчета.УдержанияОрганизаций.ИЛФиксированнойСуммой);
	//vvv
	Запрос.УстановитьПараметр("Профсоюз",ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Профсоюзные взносы"));
	Запрос.УстановитьПараметр("ДатаДеноминации",ОбщегоНазначения.ПолучитьДатуДеноминации());
	//
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	
	
	Запрос.УстановитьПараметр("ФизЛицо",Сотрудник.ФизЛицо); 
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК Месяц
	|ПОМЕСТИТЬ ВТПериоды
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//vvv комментируем, будем группировать по периоду действия
	//|	НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) КАК Месяц,
	|	НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия, МЕСЯЦ) КАК Месяц,
	//
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ В (&МатПомощьПособия)
	//vvv
	//|				ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Результат
	|				ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Результат / ВЫБОР КОГДА (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации<&ДатаДеноминации И &ДатаАктуальностиПо>=&ДатаДеноминации) ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	//
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ В (&МатПомощьПособия)
	//vvv
	//|				ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Результат
	|				ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Результат / ВЫБОР КОГДА (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации<&ДатаДеноминации И &ДатаАктуальностиПо>=&ДатаДеноминации) ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	//
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Пособия
	|ПОМЕСТИТЬ ВТОсновныеНачисления
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
	//vvv
	//|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	//
	|	И ОсновныеНачисленияРаботниковОрганизаций.Организация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	//vvv
	//|	НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
	|	НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия, МЕСЯЦ)
	//
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//vvv
	//|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) КАК Месяц,
	//|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) КАК Месяц,
	|	ВЫБОР КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ПремииРаботниковОрганизаций
	|		ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
	|	КОНЕЦ КАК Месяц,
	//
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ В (&МатПомощьПособия)
	//vvv
	//|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Результат
	|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Результат / ВЫБОР КОГДА (ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации<&ДатаДеноминации И &ДатаАктуальностиПо>=&ДатаДеноминации) ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	//
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ В (&МатПомощьПособия)
	//vvv
	//|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Результат
	|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Результат / ВЫБОР КОГДА (ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации<&ДатаДеноминации И &ДатаАктуальностиПо>=&ДатаДеноминации) ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	//
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Пособия
	|ПОМЕСТИТЬ ВТДополнительныеНачисления
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
	//vvv
	//|	И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	|	И ВЫБОР КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ПремииРаботниковОрганизаций
	|		ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
	|	КОНЕЦ МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	//
	|	И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &ГоловнаяОрганизация
	|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.ПереходящийОстаток)
	|
	|СГРУППИРОВАТЬ ПО
	//vvv
	//|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
	//|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
	|	ВЫБОР КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ПремииРаботниковОрганизаций
	|		ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
	|	КОНЕЦ
	//
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//vvv
	//|	НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.Период, МЕСЯЦ) КАК Месяц,
	|	НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ) КАК Месяц,
	//|	СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.Налог, 0)) КАК ПН
	|	СУММА(ЕСТЬNULL(НДФЛРасчетыСБюджетом.Налог, 0) / ВЫБОР КОГДА (НДФЛРасчетыСБюджетом.Период<&ДатаДеноминации И &ДатаАктуальностиПо>=&ДатаДеноминации) ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ) КАК ПН
	//
	|ПОМЕСТИТЬ ВТНалог
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//vvv
	//|	И НДФЛРасчетыСБюджетом.Период МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	|	И НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ) МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	//
	|	И НДФЛРасчетыСБюджетом.ФизЛицо = &ФизЛицо
	|	И НДФЛРасчетыСБюджетом.Организация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	//vvv
	//|	НДФЛРасчетыСБюджетом.Период
	|	НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ)
	//
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//vvv
	//|	НАЧАЛОПЕРИОДА(УдержанияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) КАК Месяц,
	|	НАЧАЛОПЕРИОДА(УдержанияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) КАК Месяц,
	//
	|	СУММА(ВЫБОР
	|			КОГДА УдержанияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&ИсполнительныеЛисты)
	|					ИЛИ УдержанияРаботниковОрганизаций.ВидРасчета = &ИспЛистФиксСуммой
	|				ТОГДА УдержанияРаботниковОрганизаций.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИсполнительныйЛист,
	//vvv
	|	СУММА(ВЫБОР
	|			КОГДА НЕ УдержанияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&ИсполнительныеЛисты)
	|					И УдержанияРаботниковОрганизаций.ВидРасчета <> &ИспЛистФиксСуммой
	|					И УдержанияРаботниковОрганизаций.ВидРасчета=&Профсоюз
	//vvv
	//|				ТОГДА УдержанияРаботниковОрганизаций.Результат
	|				ТОГДА УдержанияРаботниковОрганизаций.Результат / ВЫБОР КОГДА (УдержанияРаботниковОрганизаций.ПериодРегистрации<&ДатаДеноминации И &ДатаАктуальностиПо>=&ДатаДеноминации) ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	//
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПрофсоюзныеВзносы,
	//
	|	СУММА(ВЫБОР
	|			КОГДА НЕ УдержанияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&ИсполнительныеЛисты)
	|					И УдержанияРаботниковОрганизаций.ВидРасчета <> &ИспЛистФиксСуммой
	//vvv
	|					И УдержанияРаботниковОрганизаций.ВидРасчета <> &Профсоюз
	//|				ТОГДА УдержанияРаботниковОрганизаций.Результат
	|				ТОГДА УдержанияРаботниковОрганизаций.Результат / ВЫБОР КОГДА (УдержанияРаботниковОрганизаций.ПериодРегистрации<&ДатаДеноминации И &ДатаАктуальностиПо>=&ДатаДеноминации) ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	//
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Удержания
	|ПОМЕСТИТЬ ВТИсполнительныеЛисты
	|ИЗ
	|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизаций
	|ГДЕ
	|	УдержанияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
	//vvv
	//|	И УдержанияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	|	И НАЧАЛОПЕРИОДА(УдержанияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	|	И НЕ УдержанияРаботниковОрганизаций.ВидРасчета.НеВключатьВСправкуОДоходах
	//
	|	И УдержанияРаботниковОрганизаций.Организация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	//vvv
	//|	УдержанияРаботниковОрганизаций.ПериодРегистрации
	|	НАЧАЛОПЕРИОДА(УдержанияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
	//
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//vvv
	//|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ) КАК Месяц,
	|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
	//|	СУММА(ЕСТЬNULL(ЕСНИсчисленный.ПенсионныйФонд, 0)) КАК ПВ
	|	СУММА(ЕСТЬNULL(ЕСНИсчисленный.ПенсионныйФонд, 0) / ВЫБОР КОГДА (ЕСНИсчисленный.Период<&ДатаДеноминации  И &ДатаАктуальностиПо>=&ДатаДеноминации) ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ) КАК ПВ
	//
	|ПОМЕСТИТЬ ВТПенсионныйФонд
	|ИЗ
	|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
	|ГДЕ
	|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
	//vvv
	//|	И ЕСНИсчисленный.Период МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	|	И НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) МЕЖДУ &ДатаАктуальностиС И &ДатаАктуальностиПо
	//
	|	И ЕСНИсчисленный.Организация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	//vvv
	//|	ЕСНИсчисленный.Период
	|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
	//
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПогашениеЗаймовРаботниками.ОсновнойДолг) КАК Займ,
	|	НАЧАЛОПЕРИОДА(ПогашениеЗаймовРаботниками.Период, МЕСЯЦ) КАК Месяц
	|ПОМЕСТИТЬ ВТЗаймы
	|ИЗ
	|	РегистрНакопления.ПогашениеЗаймовРаботникамиОрганизаций КАК ПогашениеЗаймовРаботниками
	|ГДЕ
	|	ПогашениеЗаймовРаботниками.ФизЛицо = &ФизЛицо
	|	И ПогашениеЗаймовРаботниками.УдержаноИзЗарплаты
	|	И ПогашениеЗаймовРаботниками.Организация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПогашениеЗаймовРаботниками.Период, МЕСЯЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Месяц КАК Месяц,
	|	СУММА(ЕСТЬNULL(ОсновныеНачисления.Начисления, 0) + ЕСТЬNULL(ДополнительныеНачисления.Начисления, 0)) КАК Начисления,
	|	СУММА(ЕСТЬNULL(ОсновныеНачисления.Пособия, 0) + ЕСТЬNULL(ДополнительныеНачисления.Пособия, 0)) КАК МатПомощь,
	|	СУММА(ЕСТЬNULL(Налог.ПН, 0)) КАК ПН,
	|	СУММА(ЕСТЬNULL(ИсполнительныеЛисты.ИсполнительныйЛист, 0)) КАК ИсполнительныйЛист,
	|	СУММА(ЕСТЬNULL(ПенсионныйФонд.ПВ, 0)) КАК ПВ,
	|	СУММА(ЕСТЬNULL(ИсполнительныеЛисты.Удержания, 0)) КАК Удержания,
	//vvv
	|	СУММА(ЕСТЬNULL(ИсполнительныеЛисты.ПрофсоюзныеВзносы, 0)) КАК ПрофсоюзныеВзносы,
	//
	|	СУММА(ЕСТЬNULL(Займы.Займ, 0)) КАК Займ
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеНачисления КАК ОсновныеНачисления
	|		ПО Периоды.Месяц = ОсновныеНачисления.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительныеНачисления КАК ДополнительныеНачисления
	|		ПО Периоды.Месяц = ДополнительныеНачисления.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалог КАК Налог
	|		ПО Периоды.Месяц = Налог.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсполнительныеЛисты КАК ИсполнительныеЛисты
	|		ПО Периоды.Месяц = ИсполнительныеЛисты.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПенсионныйФонд КАК ПенсионныйФонд
	|		ПО Периоды.Месяц = ПенсионныйФонд.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаймы КАК Займы
	|		ПО Периоды.Месяц = Займы.Месяц
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Месяц
	|
	|УПОРЯДОЧИТЬ ПО
	|	Месяц
	|ИТОГИ
	|	СУММА(Начисления),
	|	СУММА(МатПомощь),
	|	СУММА(ПН),
	|	СУММА(ИсполнительныйЛист),
	|	СУММА(ПВ),
	|	СУММА(Удержания),
	//vvv
	|	СУММА(ПрофсоюзныеВзносы),
	//
	|	СУММА(Займ)
	|ПО
	|	ОБЩИЕ";
	
	РезультатНачислений = Запрос.Выполнить();
	ВыборкаНачислений = РезультатНачислений.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНачислений.Следующий() Цикл
		
		//vvv
		//ОбластьШапка.Параметры.СуммаПрописью = Формат(ВыборкаНачислений.Начисления + ВыборкаНачислений.МатПомощь,"ЧДЦ=0; ЧГ=3,0") + " " + РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаНачислений.Начисления + ВыборкаНачислений.МатПомощь, РеглВалюта);
		ОбластьШапка.Параметры.СуммаПрописью = Формат(ВыборкаНачислений.Начисления + ВыборкаНачислений.МатПомощь,"ЧДЦ=2; ЧГ=3,0") + " " + РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаНачислений.Начисления + ВыборкаНачислений.МатПомощь, РеглВалюта);
		//
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьШапкаТаблицы);

		ОбластьПодвалТаблицы.Параметры.ИтогоНачисления         = ВыборкаНачислений.Начисления;		
		//vvv
		ОбластьПодвалТаблицы.Параметры.ИтогоНачисления         = ВыборкаНачислений.Начисления+ВыборкаНачислений.Матпомощь;
		ОбластьПодвалТаблицы.Параметры.ИтогоПрофсоюзныеВзносы  = ВыборкаНачислений.ПрофсоюзныеВзносы;
		//
		//vvv комментируем
		//ОбластьПодвалТаблицы.Параметры.ИтогоМатпомощь          = ВыборкаНачислений.Матпомощь;
		ОбластьПодвалТаблицы.Параметры.ИтогоПН                 = ВыборкаНачислений.ПН;
		ОбластьПодвалТаблицы.Параметры.ИтогоИсполнительныйЛист = ВыборкаНачислений.ИсполнительныйЛист;
		ОбластьПодвалТаблицы.Параметры.ИтогоПВ                 = ВыборкаНачислений.ПВ;
		ОбластьПодвалТаблицы.Параметры.ИтогоУдержания          = ВыборкаНачислений.Удержания;
		ОбластьПодвалТаблицы.Параметры.ИтогоЗайм               = ВыборкаНачислений.Займ;
		ОбластьПодвалТаблицы.Параметры.ИтогоВыплата            = ВыборкаНачислений.Начисления + ВыборкаНачислений.Матпомощь - ВыборкаНачислений.ПН -  ВыборкаНачислений.ИсполнительныйЛист - ВыборкаНачислений.ПВ - ВыборкаНачислений.Удержания - ВыборкаНачислений.Займ;
		//vvv
		ОбластьПодвалТаблицы.Параметры.ИтогоВыплата            = ВыборкаНачислений.Начисления + ВыборкаНачислений.Матпомощь - ВыборкаНачислений.ПН -  ВыборкаНачислений.ИсполнительныйЛист - ВыборкаНачислений.ПВ - ВыборкаНачислений.Удержания - ВыборкаНачислений.Займ - ВыборкаНачислений.ПрофсоюзныеВзносы;
		
		ВыборкаПоМесяцам = ВыборкаНачислений.Выбрать();
		КоличествоМесяцев = ВыборкаПоМесяцам.Количество();
		
		ОбластьПодвалТаблицы.Параметры.СредняяНачисления         = ВыборкаНачислений.Начисления/КоличествоМесяцев;
		//vvv
		ОбластьПодвалТаблицы.Параметры.СредняяНачисления         = (ВыборкаНачислений.Начисления+ВыборкаНачислений.Матпомощь)/КоличествоМесяцев;
		ОбластьПодвалТаблицы.Параметры.СредняяПрофсоюзныеВзносы	 = ВыборкаНачислений.ПрофсоюзныеВзносы/КоличествоМесяцев;
		//
		//vvv комментируем
		//ОбластьПодвалТаблицы.Параметры.СредняяМатпомощь          = ВыборкаНачислений.Матпомощь/КоличествоМесяцев;
		ОбластьПодвалТаблицы.Параметры.СредняяПН                 = ВыборкаНачислений.ПН/КоличествоМесяцев;
		ОбластьПодвалТаблицы.Параметры.СредняяИсполнительныйЛист = ВыборкаНачислений.ИсполнительныйЛист/КоличествоМесяцев;
		ОбластьПодвалТаблицы.Параметры.СредняяПВ                 = ВыборкаНачислений.ПВ/КоличествоМесяцев;
		ОбластьПодвалТаблицы.Параметры.СредняяУдержания          = ВыборкаНачислений.Удержания/КоличествоМесяцев;
		ОбластьПодвалТаблицы.Параметры.СредняяЗайм               = ВыборкаНачислений.Займ/КоличествоМесяцев;
		ОбластьПодвалТаблицы.Параметры.СредняяВыплата            = (ВыборкаНачислений.Начисления + ВыборкаНачислений.Матпомощь - ВыборкаНачислений.ПН -  ВыборкаНачислений.ИсполнительныйЛист - ВыборкаНачислений.ПВ - ВыборкаНачислений.Удержания - ВыборкаНачислений.Займ)/КоличествоМесяцев;
		//vvv
		ОбластьПодвалТаблицы.Параметры.СредняяВыплата            = (ВыборкаНачислений.Начисления + ВыборкаНачислений.Матпомощь - ВыборкаНачислений.ПН -  ВыборкаНачислений.ИсполнительныйЛист - ВыборкаНачислений.ПВ - ВыборкаНачислений.Удержания - ВыборкаНачислений.Займ - ВыборкаНачислений.ПрофсоюзныеВзносы)/КоличествоМесяцев;
		
		Пока ВыборкаПоМесяцам.Следующий() Цикл
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПомесяцам);
			//vvv
			ОбластьСтрокаТаблицы.Параметры.Начисления=ВыборкаПоМесяцам.Начисления+ВыборкаПоМесяцам.МатПомощь;			
			//
			ОбластьСтрокаТаблицы.Параметры.Месяц = Месяц(ВыборкаПоМесяцам.Месяц);
			ОбластьСтрокаТаблицы.Параметры.Год   = Год(ВыборкаПоМесяцам.Месяц);
			ОбластьСтрокаТаблицы.Параметры.Выплата            = ВыборкаПоМесяцам.Начисления + ВыборкаПоМесяцам.Матпомощь - ВыборкаПоМесяцам.ПН -  ВыборкаПоМесяцам.ИсполнительныйЛист - ВыборкаПоМесяцам.ПВ - ВыборкаПоМесяцам.Удержания - ВыборкаПоМесяцам.Займ;
			//vvv
			ОбластьСтрокаТаблицы.Параметры.Выплата            = ВыборкаПоМесяцам.Начисления + ВыборкаПоМесяцам.Матпомощь - ВыборкаПоМесяцам.ПН -  ВыборкаПоМесяцам.ИсполнительныйЛист - ВыборкаПоМесяцам.ПВ - ВыборкаПоМесяцам.Удержания - ВыборкаПоМесяцам.Займ - ВыборкаПоМесяцам.ПрофсоюзныеВзносы;
			ДокументРезультат.Вывести(ОбластьСтрокаТаблицы);
		КонецЦикла;
			
	КонецЦикла;

	ДокументРезультат.Вывести(ОбластьПодвалТаблицы);
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, КонецДня(ДатаВыдачи),);
	 
    ОбластьПодвал.Параметры.ФИОРуководителя = Руководители.Руководитель;
	ОбластьПодвал.Параметры.ФИОБухгалтера   = Руководители.ГлавныйБухгалтер;
	
	ДокументРезультат.Вывести(ОбластьПодвал);	
КонецПроцедуры

	
НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
